'use client';
import { Box, Typography, Container } from '@mui/material';

export const TermsOfService = () => {
  const termsText = `この規約（以下「本規約」といいます。）は、株式会社Myca（以下「当社」といいます。）が提供するクラウド型ＰＯＳソフトウェア「本サービス」（以下「本サービス」といいます。）の利用に関する条件を、本サービスを利用するすべての契約者（第3条に規定します。）と当社との間で定めるものです。契約者は、本サービスを利用する前に、本規約をよくお読みください。

第1条（本規約への同意）
1. 契約者は、本規約に従って本サービスを利用するものとし、本規約に同意しない限り本サービスを利用することはできません。本サービスに関して当社と契約者との間で別途合意した契約書、規約、覚書等（以下、総称して「個別規約」といいます。）が存在する場合、同個別契約に規定する内容は、契約者との間で本規約の一部を構成するものとします。

2. 個別規約において別段の定めのない限り、契約者が当社と本サービス導入契約を別途締結した時点で、契約者と当社との間で、本規約の諸規定に従ったソフトウェア利用契約（以下「本サービス利用契約」といいます。）が成立します。

第2条（本規約の改定・変更）
1. 当社は、当社が必要と判断する場合、契約者の承諾を得て、本規約の内容を変更又は追加できるものとします。但し、次の各号の一に該当する場合、契約者の承諾があったものとみなすことができるものとします。

(1) 当該変更又は追加が、契約者の一般の利益に適合するとき

(2) 当該変更又は追加が、本規約を締結した目的に反せず、かつ、必要性、内容の相当性、その他の当該変更又は追加に係る事情に照らして合理的なものであるとき

2. 当社は、前項の変更又は追加を行うときは、変更後の本規約の効力発生時期を定め、効力発生時期の2週間前までに、その旨及び当該変更又は追加の内容並びにその効力発生時期をインターネットその他の適切な方法により周知するものとします。

3. 前二項の規定にかかわらず、前項の本規約の変更の周知後に契約者が本サービスを利用した場合、当該契約者は本規約の変更に同意したものとします。

第3条（用語の定義）
本規約においては、次の用語はそれぞれ次の意味で使用します。

(1) 「契約者」
当社に本サービスの提供を申し込む法人、機関等

(2) 「利用ユーザー」
契約者が承認し、本サービスを利用する者

(3) 「ユーザーID」
契約者が指定する利用ユーザーを識別するために用いられる符号

第4条（本サービスの機能）
本サービスは、別紙に記載する機能を有するソフトウェアです。契約者は、本サービスのかかる特性を踏まえ、自己の判断と責任において本サービスを利用するものとします。

第5条（導入支援等）
当社は、契約者における本サービスの導入に当たり必要な支援（契約者の業務改善に関するヒアリングその他必要な支援）を行うよう努めるものとし、契約者は、本サービスの業務利用を通じて、本サービスに対する不満、改善要望、その他利用者の要望を集約し、当社に対してフィードバックするよう努めるものとします。

第6条（遅延損害金）
契約者が、本サービスの利用料金等を所定の支払期日が過ぎてもなお支払わない場合、契約者は、所定の支払期日の翌日から支払い日の前日までの日数に、年14.6％の利率で計算した金額を遅延損害金として支払うものとします。

第7条（利用制限）
1. 本サービスは、契約者自身の業務における利用を目的として提供されるものであり、本サービスが利用ユーザーに対して提供するコンテンツを第三者に販売することその他商業目的で使用することはできません。

2. 契約者は、本サービスを、契約者の役員又は従業員に対してのみ使用させることができるものとし、その他の第三者に対して使用させることはできません。

3. 契約者は、利用ユーザーに対し、本規約に定める条件を周知し、これに従わせるものとします。

第8条（ユーザーID）
1. ユーザーIDは、当社が定める方法及び使用条件に基づいて、当社又は契約者自身が付与するものとします。

2. 契約者は、自らの管理責任により、利用ユーザーのユーザーIDを不正使用されないよう管理するものとします。

3. 契約者は、いかなる場合も、ユーザーIDを第三者に開示、貸与することはできません。

4. 当社は、ユーザーIDの不正利用によって契約者又は利用ユーザーに生じた損害について責任を負いません。当社は、ユーザーIDの認証を行った後に行われた本サービスの利用行為については、すべて契約者に帰属するものとみなすことができます。

第9条（アカウント枠の追加購入）
1. 契約者は、本サービス利用契約に定めるアカウント枠を、当社宛に適宜の方法で申し込むことにより、追加購入することが出来ます。

2. 当社が前項の申込に対して承諾したときは、契約者は、追加購入後のアカウント枠に基づき、本サービスの利用料金を支払うものとします。

第10条（監督責任）
1. 契約者は、本サービス利用に関して、利用ユーザーをして、本規約を遵守するよう監督するものとし、利用ユーザーの意思表示、通知、その他一切の行為について、契約者としての責任を負います。

2. 契約者は、利用ユーザーによる本規約の違反を認識した場合には、当社に対し、速やかに通知するものとします。

第11条（ご利用環境の整備・維持）
1. 契約者は、自己の費用と責任において、当社が定める条件にて利用ユーザーの設備を設定し、本サービス利用のための環境を維持するものとします。

2. 契約者は、本サービスを利用するにあたり自己の責任と費用をもって、電気通信事業者等の電気通信サービスを利用して利用ユーザーの設備をインターネットに接続するものとします。

3. 契約者の設備、前項に定めるインターネット接続並びに本サービス利用のための環境に不具合がある場合、当社は利用ユーザーに対して本サービスの提供義務を負わないものとします。

第12条（個人情報の取扱い）
1. 当社は、個人情報について、当社が別途定めるプライバシーポリシー（以下「プライバシーポリシー」といいます。）に則り、適正に取り扱うこととします。

2. 当社は、本サービスに入力されたデータに個人情報が含まれていた場合、これを本サービス提供以外の目的で利用しないものとし、個人情報の保護に関する法律（以下「個人情報保護法」といいます。）及びプライバシーポリシーに基づいて、紛失・破壊・改竄・漏洩等の危険から保護するための合理的な安全管理措置を講じ、厳重に管理するものとします。

3. 本サービスを利用するにあたっては、契約者も個人情報取扱事業者であることを理解し、プライバシーポリシーの作成・体制の維持を行ってください。当社は、契約者が個人情報を漏えいさせた場合、当該情報漏えいにより損害を被った個人との間の紛争において、一切責任を負いません。

第13条（禁止行為）
1. 契約者は、本サービスの利用にあたり、以下の各号のいずれかに該当する行為をしてはなりません。

(1) 本規約に違反する行為

(2) 当社又は他の契約者その他の第三者の知的財産権、肖像権、プライバシーの権利、名誉、その他の権利又は利益を侵害する行為（かかる侵害を直接又は間接に惹起する行為を含みます。）

(3) 当社又は第三者に不利益若しくは損害を与える行為又はそのおそれのある行為

(4) 不当に他人の名誉や権利、信用を傷つける行為又はそのおそれのある行為

(5) 犯罪行為に関連する行為又は公序良俗に反する行為

(6) 法令又は当社若しくは契約者が所属する業界団体の内部規則に違反する行為

(7) 他の契約者の利用を妨害する行為又はそのおそれがある行為

(8) コンピューター・ウィルスその他の有害なコンピューター・プログラムを含む情報を送信する行為

(9) 当社のシステムへの不正アクセス、それに伴うプログラムコードの改ざん、位置情報を故意に虚偽、通信機器の仕様その他アプリケーションを利用してのチート行為、コンピューター・ウィルスの頒布その他本サービスの正常な運営を妨げる行為又はそのおそれのある行為

(10) 本サービスを構成するハードウェア又はソフトウェアへの不正アクセス行為、クラッキング行為その他設備等に支障を与える等の行為

(11) 本サービスに関し利用しうる情報を改竄する行為

(12) 本サービスに関し、リバースエンジニアリング、逆コンパイル又は逆アセンブル等を実施する行為

(13) 当社による本サービスの運営を妨害するおそれのある行為

(14) 他人のユーザーIDを使用する行為又はその入手を試みる行為

(15) 反社会的勢力等へ利益を供与する行為

(16) その他、当社が不適切と判断する行為

2. 当社は、本サービスにおける契約者による情報の送信行為が前項各号のいずれかに該当し、又は該当するおそれがあると当社が判断した場合には、契約者に事前に通知することなく、当該情報の全部又は一部を削除することができるものとします。当社は、本項に基づき当社が行った措置に基づき契約者に生じた損害について一切の責任を負いません。

第14条（規約違反に対する措置等）
1. 当社は、契約者が、以下の各号のいずれかの事由に該当する場合は、事前に通知又は催告することなく、当該契約者について本サービスの利用を一時的に停止し、又は本サービス利用契約を解除することができます。

(1) 本規約のいずれかの条項に違反した場合

(2) 債務の全部又は一部の履行が不能である場合又は契約者がその債務の全部又は一部の履行を拒絶する意思を明確に表示した場合

(3) 債務の一部の履行が不能である場合又は契約者がその債務の一部の履行を拒絶する意思を明確に表示した場合において、残存する部分のみでは契約をした目的を達することができない場合

(4) 本規約上、特定の日時又は一定の期間内に履行をしなければ本規約の目的を達することができない場合において、契約者が履行をしないでその時期を経過した場合

(5) 前各号に掲げる場合のほか、契約者がその債務の履行をせず、契約をした目的を達するのに足りる履行がされる見込みがないことが明らかである場合

(6) 本サービスの利用にあたり当社に提供した情報又は当社が契約者に要請した情報に虚偽の事実があることが判明した場合

(7) 当社、他の契約者その他の第三者に損害を生じさせるおそれのある目的又は方法で本サービスを利用した、又は利用しようとした場合

(8) 手段の如何を問わず、本サービスの運営を妨害した場合

(9) 支払停止若しくは支払不能となり、又は破産手続開始、民事再生手続開始若しくはこれらに類する手続の開始の申立てがあった場合

(10) 自ら振出し、若しくは引受けた手形若しくは小切手につき、不渡りの処分を受けた場合、又は手形交換所の取引停止処分その他これに類する措置を受けた場合

(11) 差押、仮差押、仮処分、強制執行又は競売の申立てがあった場合

(12) 租税公課の滞納処分を受けた場合

(13) 死亡した場合又は後見開始、保佐開始若しくは補助開始の審判を受けた場合

(14) 当社からの連絡に対して応答がない場合

2. 当社は、本条に基づき当社が行った行為により契約者に生じた損害について一切の責任を負いません。

第15条（損害賠償）
1. 当社は、本規約に違反することにより契約者に損害を与えた場合、契約者に対しその損害（直接損害に限る）を賠償します。

2. 契約者は、本規約に違反することにより、又は本サービスの利用に関連して当社に損害を与えた場合、当社に対しその損害を賠償しなければなりません。

3. 契約者が、本サービスに関連して他の契約者その他の第三者からクレームを受け又はそれらの者との間で紛争を生じた場合には、直ちにその内容を当社に通知するとともに、契約者の費用と責任において当該クレーム又は紛争を処理し、当社からの要請に基づき、その経過及び結果を当社に報告するものとします。

4. 契約者による本サービスの利用に関連して、当社が、他の契約者その他の第三者から権利侵害その他の理由により何らかの請求を受けた場合は、契約者は当該請求に基づき当社が当該第三者に支払を余儀なくされた金額を賠償しなければなりません。但し、当社の故意又は過失に起因する場合はこの限りではありません。

5. 第1項又は第2項の定めにかかわらず、本サービス利用契約の当事者は、相手方に生じた損害のうち特別な事情から生じた損害（当社又は契約者が損害発生につき予見したもの及び予見すべきであったものを含みます。）については一切の責任を負わないものとします。

6. 当社が契約書に対して損害賠償義務を負う場合であっても、当社が負う賠償責任の範囲は、当社が契約者から受領した本サービス過去１年間の利用料の累積額を上限とします。

第16条（機密保持）
1. 契約者及び当社は、本サービス導入に関し、相手方から開示された機密情報を第三者に開示又は漏洩してはなりません。なお、機密情報とは、文書、電磁的データ、口頭その他形式の如何を問わず、又は秘密の表示若しくは明示又はその範囲の特定の有無にかかわらず、本サービス導入に関して開示された相手方の技術上、営業上又は経営上の情報をいい、本サービスの契約条件を含みます。

2. 次の各号の情報は、機密情報に該当しないものとします。

(1) 開示を受けた時、既に所有していた情報

(2) 開示を受けた時、既に公知であった情報又はその後自己の責に帰さない事由により公知となった情報

(3) 開示を受けた後に、第三者から合法的に取得した情報

(4) 開示された機密情報によらず独自に開発し又は創作した情報

(5) 法令の定め又は裁判所の命令に基づき開示を要請された情報

3. 契約者及び当社は、機密情報を本サービスの提供・改善のため必要のある役職員（雇用契約、委任契約又は業務委託契約等の契約形態を問わず自己の業務に従事する者をいいます。）、共同研究者、業務委託先、外部アドバイザー等であって機密保持義務を負う者にのみ開示できるものとし、かつ開示目的以外の目的には使用しないものとします。

4. 契約者及び当社は、本サービスの終了、本サービス利用契約の解約その他の事由により本サービス利用契約が終了した場合、相手方の指示に従い機密情報を速やかに返還又は廃棄します。なお、廃棄にあたっては、機密情報を再利用できない方法をとるものとします。

第17条（知的財産権の帰属）
1. 契約者及び当社は、本サービスを構成する一切の発明、考案、意匠、著作物（当社が契約者の依頼を受けて契約者のために作成する著作物を含みます。）、商標、商号その他事業活動に用いられる商品又は役務を表示するもの及び営業秘密その他の事業活動に有用な技術上又は営業上の情報に関する、特許権、実用新案権、意匠権、著作権（著作権法第27条及び第28条に規定する権利を含みます。）、商標権を含む一切の権利が当社に帰属することを確認します。

2. 契約者は当社に対し、契約者が本サービスにアップロードした情報及び本サービス上で作成した情報について、ホスト、保存、バックアップのための複製を行うことを許諾するものとし、著作者人格権を行使しないものとします。

第18条（契約の解除）
1. 契約者は、当社と別途締結する本契約の契約期間中であっても、3ヶ月前までに当社に対して書面により申し出ることにより、当該契約を解除し、もって本サービス利用契約を解除することができます。この場合において、契約者は、本サービスの残期間分の本サービス利用料を当社に対して一括で支払い（月額払いの場合）、当社に対し、本サービス導入費用及び本サービス利用料等一切の費用の返還を求めることはできません（一括前払いの場合）。

2. 当社は、当社において本サービスの継続が困難であると判断した場合には、契約者に通知することにより、本契約を解約することができるものとします。

第19条（本サービスの変更・停止等）
1. 当社は、契約者に事前に通知することなく、本サービスの内容の全部又は一部を変更又は追加することができるものとします。但し、当該変更又は追加によって、変更又は追加前の本サービスのすべての機能・性能が維持されることを保証するものではありません。

2. 当社は、以下のいずれかに該当する場合には、本サービスの利用の全部又は一部を停止又は中断することができるものとします。この場合において、当社は契約者に対して、できる限り事前に通知するよう努めるものとします。

(1) 本サービスに係るコンピューター・システムの点検又は保守作業を定期的又は緊急に行う場合

(2) コンピューター、通信回線等が事故により停止した場合

(3) 火災、停電、天災地変等の不可抗力により本サービスの運営ができなくなった場合

(4) サーバがサイバー攻撃の被害に遭った場合

(5) その他、当社が本サービスの停止又は中断を必要と合理的に判断した場合

3. 当社は、本条により契約者に生じた不利益、損害について責任を負いません。

第20条（保証の制限及び免責）
1. 当社は、本サービスについて、その正確性、最新性、有用性、信頼性、適法性、特定目的への適合性、第三者の権利を侵害していないことについて一切の保証をしません。

2. 契約者は自己の責任において本サービスを利用するものとし、当社は、契約者による本サービスの利用に起因して契約者に生じたあらゆる損害について一切の責任を負いません。但し、本サービスに関する契約者と当社との間の契約が消費者契約法に定める消費者契約となる場合、この免責規定は適用されません。

第21条（再委託）
当社は、本サービスの提供に関して、全部又は一部の業務を、当社の責任において第三者に再委託できるものとします。

第22条（反社会的勢力の排除）
1. 契約者及び当社は、現在、暴力団、暴力団員、暴力団員でなくなった時から5年を経過しない者、暴力団準構成員、暴力団関係企業、総会屋等、社会運動等標ぼうゴロ又は特殊知能暴力集団等、その他これらに準ずる者（以下「暴力団員等」という。）に該当しないこと、及び次の各号のいずれにも該当しないことを表明し、かつ将来にわたっても該当しないことを確約します。

(1) 暴力団員等が経営を支配していると認められる関係を有すること

(2) 暴力団員等が経営に実質的に関与していると認められる関係を有すること

(3) 自己、自社若しくは第三者の不正の利益を図る目的又は第三者に損害を加える目的をもってする等、不当に暴力団員等を利用していると認められる関係を有すること

(4) 暴力団員等に対して資金等を提供し、又は便宜を供与する等の関与をしていると認められる関係を有すること

(5) 役員又は経営に実質的に関与している者が暴力団員等と社会的に非難されるべき関係を有すること

2. 契約者及び当社は、自ら又は第三者を利用して次の各号のいずれにも該当する行為を行わないことを確約します。

(1) 暴力的な要求行為

(2) 法的な責任を超えた不当な要求行為

(3) 取引に関して、脅迫的な言動をし、又は暴力を用いる行為

(4) 風説を流布し、偽計を用い又は威力を用いて相手方の信用を毀損し、又は相手方の業務を妨害する行為

(5) その他前各号に準ずる行為

3. 契約者又は当社が、暴力団員等若しくは第1項各号のいずれかに該当し、若しくは前項各号のいずれかに該当する行為をし、又は第1項の規定にもとづく表明・確約に関して虚偽の申告をしたことが判明した場合には、自己の責に帰すべき事由の有無を問わず、相手方に対して何らの催告をすることなく本サービス利用契約を解除することができるものとします。

4. 契約者及び当社は、前項により本サービス利用契約を解除した場合には、相手方に損害が生じたとしてもこれを一切賠償する責任はないことを確認し、これを了承します。

第23条（連絡・通知）
本サービスに関する問い合わせその他契約者から当社に対する連絡又は通知、及び本規約の変更に関する通知その他当社から契約者に対する連絡又は通知は、電子メールその他当社の定める方法で行うものとします。通知は、当社からの発信によってその効力が生ずるものとします。

第24条（地位の譲渡等）
契約者及び当社は、相手方の書面による事前の承諾なく、本サービス利用契約上の地位又は本規約に基づく権利若しくは義務の全部又は一部につき、第三者に対し、譲渡、移転、担保設定、その他の処分をすることはできません。但し、株式譲渡若しくは事業譲渡又は合併、会社分割その他の組織再編についてはこの限りではありません。

第25条（分離可能性）
1. 本規約のいずれかの条項又はその一部が無効又は執行不能と判断とされた場合であっても、当該判断は他の部分に影響を及ぼさず、本規約の残りの部分は、引き続き有効かつ執行力を有するものとします。当社及び契約者は、当該無効若しくは執行不能とされた条項又は部分の趣旨に従い、これと同等の効果を確保できるように努めるとともに修正された本規約に拘束されることに同意するものとします。

2. 本規約のいずれかの条項又はその一部が、ある契約者との関係で無効又は執行不能と判断された場合であっても、他の契約者との関係における有効性等には影響を及ぼさないものとします。

第26条（存続条項）
本契約が終了した場合でも、第12条（個人情報の取扱い）、第15条（損害賠償）、第16条（機密保持）、第17条（知的財産権の帰属）、本条（存続条項）及び第28条（準拠法及び合意管轄）は有効に存続するものとします。

第27条（不可抗力）
当社は、天災、法令・規則の制定・改廃、疫病・感染症の流行その他の不可抗力によって本サービスの履行が妨げられた場合には、本サービス利用契約その他の一切の規定にかかわらず、かかる不可抗力によって契約者に生じた損害について一切の責任を負担しません。

第28条（準拠法及び合意管轄）
本規約の準拠法は日本法とし、本規約に起因し又は関連する一切の紛争については、東京地方裁判所を第一審の専属的合意管轄裁判所とします。

第29条（協議解決）
契約者及び当社は、本規約に定めのない事項又は本規約の解釈に疑義が生じた場合には、互いに信義誠実の原則に従って協議の上速やかに解決を図るものとします。

2025年3月10日　制定・施行

別紙　本システムの機能

１　商品カードの登録機能

２　トレーディングカードの販売・買取機能

３　在庫管理・棚卸機能

４　Mycalinksアプリ連動

５　上記に関する事項`;

  return (
    <Container sx={{ p: 0 }}>
      <Box
        p={1}
        sx={{
          overflowY: 'auto',
          border: 1,
          borderColor: 'grey.300',
          borderRadius: 1,
          maxHeight: '200px',
        }}
      >
        <Typography variant="h5" fontWeight="bold">
          サービス利用規約
        </Typography>
        <Typography
          variant="body2"
          component="div"
          sx={{ whiteSpace: 'pre-wrap' }}
        >
          {termsText}
        </Typography>
      </Box>
    </Container>
  );
};
